[
    {
        "id": "1",
        "title":"Booki",
        "pictures": [
            "/images/booki-homepage.jpg"
        ],
        "about":"Intégration de l'interface utilisateur d'un site de recherche d'hébergements et d'activités en HTML/CSS, conformément à une maquette.",
        "description":"Premier projet de la formation OpenClassrooms 'Développeur Web Junior'.",
        "category":[
            {
                "id": "1",
                "name":"Intégration HTML/CSS"
            }
        ],
        "tags": [
            "Front-end",
            "HTML/CSS",
            "Intégration maquette",
            "Media queries"
        ],
        "technos":[
            "HTML",
            "CSS"
        ],
        "objectives":[
            "Intégrer l'interface visuelle statique de la page d'accueil du site Booki, en HTML et CSS (barre de recherche et filtres non fonctionnels).",
            "Assurer une expérience utilisateur optimale sur divers appareils en implémentant une version desktop (first), tablette et mobile avec 2 breakpoints (1024px et 768px).",
            "Respecter une charte graphique et une maquette Figma."
        ],
        "skills": [
            "Découpage d'une maquette",
            "Structuration d'une page web avec les balises HTML sémantiques appropriées",
            "Disposition du contenu avec flexbox / grid",
            "Intégration d'une interface responsive à l'aide des Media Queries",
            "Versionnage d'un projet avec Git et GitHub"
        ],
        "url":"https://itgbarbara.github.io/oc-devweb-projet-2-booki/",
        "repo":"https://github.com/itgbarbara/oc-devweb-projet-2-booki"
    },
    {
        "id": "2",
        "title":"Sophie Bluel",
        "pictures":[
            "https://www.noiise.com/wp-content/uploads/2022/12/definition-site-web-1.jpg"
        ],
        "about":"Communication avec une API pour rendre le portfolio d'une architecte d'intérieur dynamique et intéractif, grâce à JavaScript.",
        "description":"Second projet de la formation OpenClassrooms 'Développeur Web Junior'.",
        "category": [
            {
                "id": "2",
                "name":"JavaScript"
            }
        ],
        "tags": [
            "JavaScript",
            "Manipulation du DOM",
            "Gestion d'évènements",
            "Fetch API",
            "LocalStorage"
        ],
        "technos":[
            "HTML",
            "CSS",
            "JavaScript"
        ],
        "objectives":[
            "Rendre une page web dynamique et intéractive avec JavaScript, sans utiliser de framework, à partir de la version statique du site d'origine (code HTML / CSS existant).",
            "Développer une version fonctionnelle de la gestion de la galerie des travaux de l'architecte.",
            "Permettre à l'utilisateur d'afficher et de filtrer les travaux sur la page d'accueil.",
            "Permettre à l'administrateur du site de s'authentifier en récupérant un token, pour pouvoir ajouter ou supprimer des travaux à la galerie à l'aide d'une boîte de dialogue modale (à créer).",
            "Mémoriser les données récupérées dans la mémoire locale du navigateur pour optimiser le chargement de la galerie ou maintenir l'administrateur connecté.",
            "Tester les nouvelles fonctionnalités grâce à la mise à disposition d'une API http et de sa documentation."
        ],
        "skills": [
            "Manipulation des éléments du DOM",
            "Gestion des évènements utilisateurs",
            "Récupération de la saisie des formulaires",
            "Communication avec une API et opérations asynchrones",
            "Gestion du LocalStorage"
        ],
        "url":"",
        "repo":"https://github.com/itgbarbara/oc-devweb-projet-3-portfolio-architecte-sophie-bluel"
    },
    {
        "id": "3",
        "title":"Kasa",
        "pictures": [
            "/images/homepage-kasa.jpg",
            "/images/about-kasa.jpg",
            "/images/location-kasa.jpg"
        ],
        "about":"Intégration de l'interface utilisateur d'une application web de location immobilière avec React, conformément à une maquette.",
        "description":"Quatrième projet de la formation OpenClassrooms 'Développeur Web Junior'.",
        "category":[
            {
                "id": "1",
                "name":"Intégration HTML/CSS"
            },
            {
                "id": "3",
                "name":"React"
            }
        ],
        "tags": [
            "Front-end",
            "React",
            "Intégration maquette",
            "Media Queries",
            "Sass"
        ],
        "technos":[
            "React",
            "Sass"
        ],
        "objectives":[
            "Développer une interface utilisateur moderne et réactive en utilisant la librairie React.",
            "Créer une single-page application (SPA) avec une navigation fluide et dynamique, en immitant le comportement d'un site web multi-page traditionnel.",
            "Gérer les propriétés d'un composant (state local et props) et la logique de présentation des données (extraites d'un fichier JSON) pour produire du code plus lisible facile à maintenir.",
            "Améliorer l'expérience utilisateur en associant des animations à certains éléments intéractifs."
        ],
        "skills": [
            "Découpage d'une application en composants modulaires et réutilisables",
            "Configuration de la navigation entre les pages de l'application avec React Router",
            "Utilisation des props et des hooks de base (useState, useEffect, useParams, useContext...)",
            "Organisation et optimisation du code avec Sass, en appliquant les méthodes DRY (utilisation de variables et de mixins) et BEM.",
            "Intégration d'une interface responsive à l'aide des Media Queries"
        ],
        "url":"",
        "repo":"https://github.com/itgbarbara/oc-devweb-projet-5-kasa-react"
    },
    {
        "id": "4",
        "title":"Mon Vieux Grimoire",
        "pictures":[
            "https://www.noiise.com/wp-content/uploads/2022/12/definition-site-web-1.jpg"
        ],
        "about":"Mise en place du back-end d'un site de référencement et de notation de livres avec Node.js et Express.",
        "description":"Cinquième projet de la formation OpenClassrooms 'Développeur Web Junior'.",
        "category": [
            {
                "id": "4",
                "name":"Node.js/Express"
            }
        ],
        "tags": [
            "Back-end",
            "API Rest",
            "Node.js",
            "Express",
            "MongoDB",
            "Sécurité"
        ],
        "technos":[
            "Node.js",
            "Express",
            "MongoDB"
        ],
        "objectives":[
            "Structurer une application selon l'architecture Modèle - Vue - Contrôleur (MVC)",
            "Connecter un serveur Node.js / Express à une base de données MongoDB.",
            "Implémenter un middleware d'authentification pour permettre aux utilisateurs du site d'accéder aux routes protégées de l'API.",
            "Permettre aux utilisateurs authentifiés de créer, noter, modifier et supprimer un livre.",
            "Ajouter une fonctionnalité pour calculer et afficher la note moyenne de chaque livre.",
            "Gérer le téléchargement et l'optimisation des images de couvertures soumises par les contributeurs du site."
        ],
        "skills": [
            "Création d'une API RESTful avec Node.js et Express",
            "Mise en place d'un modèle logique de données avec Mongoose",
            "Implémentation d'opérations CRUD",
            "Gestion du téléchargement et de l'optimisation des images",
            "Sécurisation de l'API et des données stockées (cryptage des données sensibles, utilisation de jsonwebtokens...) "
        ],
        "url":"",
        "repo":"https://github.com/itgbarbara/oc-devweb-projet-6-mon-vieux-grimoire"
    }
]